ChisBread/gpsp/sdkconfig.defaults
# ESP32-P4 SDK configuration defaults for gpsp
# Target board: JC4880P443C_I_W

# Target
CONFIG_IDF_TARGET="esp32p4"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM (OPI 200MHz)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# CPU frequency (400 MHz)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=400

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Task watchdog - extend for emulation
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Cache configuration - maximize for display and emulation
CONFIG_CACHE_L2_CACHE_SIZE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_SIZE_64B=y

# FAT filesystem for ROM loading from SD card
CONFIG_FATFS_LONG_FILENAMES=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# SDMMC
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y

# I2C for ES8311 codec + GT911 touch
CONFIG_I2C_ISR_IRAM_SAFE=y

# LCD ST7701 panel type
CONFIG_BSP_LCD_TYPE_1024_600=y
